units = [
    "ноль", "один", "два", "три", "четыре",
    "пять", "шесть", "семь", "восемь", "девять"
]

teens = [
    "десять", "одиннадцать", "двенадцать",
    "тринадцать", "четырнадцать", "пятнадцать",
    "шестнадцать", "семнадцать", "восемнадцать",
    "девятнадцать"
]

tens = [
    "", "", "двадцать", "тридцать", "сорок",
    "пятьдесят", "шестьдесят", "семьдесят",
    "восемьдесят", "девяносто"
]

number = input("Введите число от 0 до 99: ")

if number.isdigit() and 0 <= int(number) <= 99:
    number = int(number)

    if number < 10:
        print(units[number])
    elif number < 20:
        print(teens[number - 10])
    else:
        result = tens[number // 10]
        if number % 10 != 0:
            result += " " + units[number % 10]
        print(result)
else:
    print("Ошибка! Введите число от 0 до 99.")